

#Область ОбработчикиСобытийФормы
// Код процедур и функций




#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций
&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	ОснованиеПриИзмененииНаСервере();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций
&НаСервере
Процедура ОснованиеПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Объект.Аттракцион=Объект.Основание.Аттракцион.Ссылка;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
